Catalogs/ХарактеристикиНоменклатурыДляЦенообразования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ХарактеристикиНоменклатурыДляЦенообразования</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоРеквизитов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизитыЦенообразования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ХарактеристикиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ХарактеристикиНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ВидыНоменклатуры</xr:Item>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Принципал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КиЗГИСМGTIN</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.GTIN</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаНоменклатурыДляЦенообразования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатурыДляЦенообразования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КР_Размер</Name>
					<Comment>[A2105505-324] Разработка по ФДР С51.002 Доработка справочника Номенклатура и сопутствующих ему объектов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КР_Размеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КР_КодТНВЭД</Name>
					<Comment>[A2105505-324] Разработка по ФДР С51.002 Доработка справочника Номенклатура и сопутствующих ему объектов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторТНВЭД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КР_Штрихкод</Name>
					<Comment>JIRA№ A2105505-1802</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ХарактеристикиНоменклатурыДляЦенообразования/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получить характеристику номенклатуры для ценообразования.
// 
// Параметры:
//  РеквизитыДляПоиска - Структура - Реквизиты для поиска
// 
// Возвращаемое значение:
//  СправочникСсылка.ХарактеристикиНоменклатурыДляЦенообразования - Получить характеристику номенклатуры для ценообразования
Функция ПолучитьХарактеристикуНоменклатурыДляЦенообразования(РеквизитыДляПоиска) Экспорт

	ТаблицаРезультата = НайтиХарактеристикиПоНаборуРеквизитов(РеквизитыДляПоиска);
	
	Если ТаблицаРезультата.количество()>0 Тогда
		Возврат ТаблицаРезультата[0].ХарактеристикаНоменклатуры;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);
	
	МассивДляФормированияНаименования = Новый Массив();
		
	ХарактеристикаЦенообразования = Справочники.ХарактеристикиНоменклатурыДляЦенообразования.СоздатьЭлемент();
	ХарактеристикаЦенообразования.ВидНоменклатуры = РеквизитыДляПоиска.ВидНоменклатуры;
	Для Каждого Строка Из РеквизитыДляПоиска.РеквизитыДляКлючаЦен Цикл
		Если Строка.ЭтоДопРеквизит Тогда
			НоваяСтрокаДополнительныхРеквизитов = ХарактеристикаЦенообразования.ДополнительныеРеквизитыЦенообразования.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаДополнительныхРеквизитов, Строка);
		Иначе
			ХарактеристикаЦенообразования[Строка.ИмяРеквизита] = Строка.Значение;
		КонецЕсли;
		
		МассивДляФормированияНаименования.Добавить(Строка.Значение);
	КонецЦикла;
		
	Если Не ЗначениеЗаполнено(ХарактеристикаЦенообразования.Наименование) Тогда
		ХарактеристикаЦенообразования.Наименование = СтрСоединить(МассивДляФормированияНаименования, ", ");
	КонецЕсли;
	
	ХарактеристикаЦенообразования.КоличествоРеквизитов = РеквизитыДляПоиска.РеквизитыДляКлючаЦен.Количество();
	
	ХарактеристикаЦенообразования.Записать();
	
	Возврат ХарактеристикаЦенообразования.Ссылка;
	
КонецФункции

// Синхронизировать пометку удаления.
// 
// Параметры:
//  ПараметрыСинхронизации - Структура - Параметры синхронизации
// 
// Возвращаемое значение:
//  Булево - Синхронизировать пометку удаления
Функция СинхронизироватьПометкуУдаления(ПараметрыСинхронизации) Экспорт

	ОперацияВыполнена = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХарактеристикиНоменклатуры.Ссылка
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатурыДляЦенообразования КАК
	|			ХарактеристикиНоменклатурыДляЦенообразования
	|		ПО ХарактеристикиНоменклатуры.ХарактеристикаНоменклатурыДляЦенообразования = ХарактеристикиНоменклатурыДляЦенообразования.Ссылка
	|ГДЕ
	|	ХарактеристикиНоменклатурыДляЦенообразования.Ссылка = &Ссылка
	|	И НЕ ХарактеристикиНоменклатуры.ПометкаУдаления
	|	И НЕ ХарактеристикиНоменклатуры.Ссылка = &ХарактеристикаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХарактеристикиНоменклатурыДляЦенообразования.ПометкаУдаления КАК ПометкаУдаления
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатурыДляЦенообразования КАК ХарактеристикиНоменклатурыДляЦенообразования
	|ГДЕ
	|	ХарактеристикиНоменклатурыДляЦенообразования.Ссылка = &Ссылка
	|	И НЕ ХарактеристикиНоменклатурыДляЦенообразования.ПометкаУдаления = &ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", ПараметрыСинхронизации.ХарактеристикаНоменклатуры);
	Запрос.УстановитьПараметр("Ссылка", ПараметрыСинхронизации.ХарактеристикаНоменклатурыДляЦенообразования);
	Запрос.УстановитьПараметр("ПометкаУдаления",  ПараметрыСинхронизации.ПометкаУдаления);
	
	Результаты = Запрос.ВыполнитьПакет();
	
	// если пометки на удаление не отличаются
	Если Результаты[1].Выгрузить().Количество() = 0 Тогда
		Возврат ОперацияВыполнена;
	КонецЕсли;
	
	// если нет больше ссылок на характеристику ценообразования, изменяем пометку
	Если Результаты[0].Выгрузить().Количество() = 0 Тогда
		Попытка
			СпрОбъект = ПараметрыСинхронизации.ХарактеристикаНоменклатурыДляЦенообразования.ПолучитьОбъект();
			СпрОбъект.ПометкаУдаления = ПараметрыСинхронизации.ПометкаУдаления;
			СпрОбъект.Записать();
		Исключение
			ОперацияВыполнена = Ложь;
		КонецПопытки;
	КонецЕсли;
	
	Возврат ОперацияВыполнена;

КонецФункции


#КонецОбласти
	
#Область СлужебныеПроцедурыИФункции

Функция НайтиХарактеристикиПоНаборуРеквизитов(РеквизитыДляПоиска)
	
	ТаблицаНайдено = Новый ТаблицаЗначений();
	
	РеквизитыДляКлючаЦен = РеквизитыДляПоиска.РеквизитыДляКлючаЦен;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидНоменклатуры", РеквизитыДляПоиска.ВидНоменклатуры);
	
	ИмяТаблицы = "ТаблицаХарактеристик";
	
	ТекстЗапросаПоДопРеквизитам = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаХарактеристик.Ссылка КАК ХарактеристикаНоменклатуры
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ДополнительныеРеквизитыЦенообразования КАК ТаблицаХарактеристик";
	
	ТекстУсловияПоДопРеквизитам = "
	|ГДЕ
	|	ТаблицаХарактеристик.Ссылка.ВидНоменклатуры = &ВидНоменклатуры
	|	И ТаблицаХарактеристик.Ссылка.КоличествоРеквизитов = &КоличествоРеквизитов";
	
	ТекстУсловияПоДопРеквизитамВ = "
	|	И ТаблицаХарактеристик.Ссылка В ";
	
	ТекстЗапросаПоРеквизитам = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаХарактеристик.Ссылка КАК ХарактеристикаНоменклатуры
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатурыДляЦенообразования КАК ТаблицаХарактеристик";
	
	ТекстУсловияПоРеквизитам = "
	|ГДЕ
	|	ТаблицаХарактеристик.ВидНоменклатуры = &ВидНоменклатуры
	|	И ТаблицаХарактеристик.КоличествоРеквизитов = &КоличествоРеквизитов";
	
	СчетчикУсловийПоРеквизитам = 0;
	СчетчикУсловийПоДопРеквизитам = 0;
	
	// Генерируем текст условия запроса по дополнительным реквизитам, устанавливаем параметры.
	Для Каждого СтрокаУсловия Из РеквизитыДляКлючаЦен Цикл
		
		Если СтрокаУсловия.ЭтоДопРеквизит Тогда
			СтрокаСчетчикУсловийПоДопРеквизитам = Формат(СчетчикУсловийПоДопРеквизитам,"ЧГ=0");
	
			ИмяТаблицыСУсловием = ИмяТаблицы + "СУсловиемПоДопРеквизиту_" + СтрокаСчетчикУсловийПоДопРеквизитам;
			
			ТекстУсловияПоДопРеквизитам = ТекстУсловияПоДопРеквизитам +
			"
			|  И " + ИмяТаблицыСУсловием + ".Свойство = &СвойствоДоп_" + СтрокаСчетчикУсловийПоДопРеквизитам + 
			"
			|  И " + ИмяТаблицыСУсловием + ".Значение = &ЗначениеДоп_" + СтрокаСчетчикУсловийПоДопРеквизитам +
			"
			|  И " + ИмяТаблицыСУсловием + ".Ссылка.ВидНоменклатуры = &ВидНоменклатуры";
			
			Запрос.УстановитьПараметр("СвойствоДоп_" + СтрокаСчетчикУсловийПоДопРеквизитам, СтрокаУсловия.Свойство);
			Запрос.УстановитьПараметр("ЗначениеДоп_" + СтрокаСчетчикУсловийПоДопРеквизитам, СтрокаУсловия.Значение);
			
			ТекстСоединения = "
			| ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ДополнительныеРеквизитыЦенообразования КАК " + ИмяТаблицыСУсловием + "
			| ПО ТаблицаХарактеристик.Ссылка = " + ИмяТаблицыСУсловием + ".Ссылка";
			
			ТекстЗапросаПоДопРеквизитам = ТекстЗапросаПоДопРеквизитам + ТекстСоединения;
			СчетчикУсловийПоДопРеквизитам = СчетчикУсловийПоДопРеквизитам + 1;
		Иначе
			СтрокаСчетчикУсловийПоРеквизитам = Формат(СчетчикУсловийПоРеквизитам,"ЧГ=0");				
	
			ИмяТаблицыСУсловием = ИмяТаблицы + "СУсловиемПоРеквизиту_" + СтрокаСчетчикУсловийПоРеквизитам;
			
			ТекстУсловияПоРеквизитам = ТекстУсловияПоРеквизитам +
			"
			|  И " + ИмяТаблицыСУсловием + "." + СтрокаУсловия.ИмяРеквизита + " = &Значение_" + СтрокаСчетчикУсловийПоРеквизитам +
			"
			|  И " + ИмяТаблицыСУсловием + ".ВидНоменклатуры = &ВидНоменклатуры";
			
			Запрос.УстановитьПараметр("Значение_" + СтрокаСчетчикУсловийПоРеквизитам, СтрокаУсловия.Значение);
			
			ТекстСоединения = "
			| ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатурыДляЦенообразования КАК " + ИмяТаблицыСУсловием + "
			| ПО ТаблицаХарактеристик.Ссылка = " + ИмяТаблицыСУсловием + ".Ссылка";
			
			ТекстЗапросаПоРеквизитам = ТекстЗапросаПоРеквизитам + ТекстСоединения;
			СчетчикУсловийПоРеквизитам = СчетчикУсловийПоРеквизитам + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	Если СчетчикУсловийПоРеквизитам = 0
		И СчетчикУсловийПоДопРеквизитам  = 0 Тогда
		Возврат ТаблицаНайдено;
	КонецЕсли;
	
	ЧастиЗапроса = Новый Массив;
	Если СчетчикУсловийПоДопРеквизитам > 0 Тогда
		ЧастиЗапроса.Добавить(ТекстЗапросаПоДопРеквизитам + ТекстУсловияПоДопРеквизитам);
	КонецЕсли;
	
	Если СчетчикУсловийПоРеквизитам > 0 Тогда
		ЧастиЗапроса.Добавить(ТекстЗапросаПоРеквизитам + ТекстУсловияПоРеквизитам);
	КонецЕсли;
	
	Если ЧастиЗапроса.Количество()>1 Тогда
		Запрос.Текст	= ЧастиЗапроса[0] + ТекстУсловияПоДопРеквизитамВ + "(" + ЧастиЗапроса[1] + ")";
	иначе
		Запрос.Текст = ЧастиЗапроса[0];
	КонецЕсли;	

	Запрос.УстановитьПараметр("КоличествоРеквизитов", (СчетчикУсловийПоРеквизитам + СчетчикУсловийПоДопРеквизитам));
	
	ТаблицаНайдено	= Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаНайдено;
КонецФункции

#Область ОбновлениеИнформационнойБазы

#КонецОбласти

#КонецОбласти

#КонецЕсли
